
/**
  *************************************************************************
  * @file    AT.h
  * @author  LZY.Huaqian
  * @version V2.0.0
  * @date    2020/03/18
  * @brief
  *************************************************************************
  * @attention
  *
  * <h2><center>&Copyright(c) 2014-2020 Xiamen HuaQian Studio</center></h2>
  *
  *************************************************************************
  */

  /*************************     防重复包含定义     *************************/
#ifndef __AT_H__
#define __AT_H__

/*************************     系统头文件包含     *************************/


/*************************     私有头文件包含     *************************/
#include "common_cfg.h"
/*************************      导入命名空间      *************************/

/*************************      C++ 兼容定义      *************************/
#ifdef __cplusplus 
#if __cplusplus 
extern "C" {
#endif 
#endif

	/*************************        全局枚举        *************************/

	/*************************       全局宏定义       *************************/

/*************************     全局结构体定义     *************************/

/*************************      全局变量定义      *************************/

/*************************        函数声明        *************************/
	void p_uart_send_string(const char* c);
	void p_at_format_data(u16 max_len);
	void p_at_clear_recv_buffer(void);
	uint16_t p_at_wait_data(uint8_t wait_ok_err, uint16_t wait_10ms_max, uint8_t need_format);
	u16 p_at_wait_2_ok(u16 wait_10ms_max);
	char* p_at_get_line(char* line, u32 max_len);
	/*************************      C++ 兼容定义      *************************/
#ifdef __cplusplus 
#if __cplusplus 
}
#endif 
#endif

/*************************     防重复包含定义     *************************/
#endif



